Revit 2024 API
TopographySurface.GetInteriorPoints Method
 Gets all of the points that are not boundary points for the topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<XYZ> GetInteriorPoints()
Visual Basic
Public Function GetInteriorPoints As IList(Of XYZ)
Visual C++
public:
IList<XYZ^>^ GetInteriorPoints()
Return Value
 The collection of interior points.
Remarks
 This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element. For a SiteSubRegion, this returns the points inherited from the host TopographySurface. For the topography surface associated with a BuildingPad element, this returns an empty collection.
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace